{
  "backend/main.mo": "Motoko backend actor providing HTTP outcall functions to fetch Quran surahs, prayer times by city/country, and Islamic calendar data from external APIs.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features: Quran navigation, Islamic calendar, prayer times, and Islamic-themed UI design with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 14 frontend files covering routing, pages, components, hooks, and styling for the Islamic Companion application.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes with OKLCH color values for the Islamic design system.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the Islamic Companion React application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root layout and four routes (home, Quran, calendar, prayer times) with Layout wrapper component.",
  "frontend/src/components/FestivalCard.tsx": "Card component displaying Islamic festival details including name, Gregorian/Hijri dates, and optional description with Islamic-themed styling.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky header navigation, crescent moon logo, responsive nav buttons, Islamic pattern background, and footer with caffeine.ai attribution.",
  "frontend/src/components/LocationSelector.tsx": "Form component with city and country inputs allowing users to submit location for fetching prayer times.",
  "frontend/src/components/PrayerTimeDisplay.tsx": "Displays five daily prayer times with current prayer highlighting, Hijri date, and location information in an elegant card layout.",
  "frontend/src/components/SurahContent.tsx": "Displays a Quran surah with Arabic text and translations, including navigation buttons to move between surahs and a scrollable list of verses with verse numbers.",
  "frontend/src/components/SurahList.tsx": "Renders a scrollable sidebar list of all 114 Quran surahs with their Arabic and English names, verse counts, and selection highlighting.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching Quran surahs, prayer times, and Islamic calendar data from the backend actor, with holiday description mapping.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Islamic-themed color palette (gold, emerald, teal) and dark mode support, plus Arabic font styling utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/CalendarPage.tsx": "Displays Islamic calendar festivals and important dates with year selection dropdown, loading states, and grid layout of festival cards.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying three main feature cards (Quran, Prayer Times, Islamic Calendar) with navigation links, icons, and descriptions using TanStack Router and Lucide icons.",
  "frontend/src/pages/PrayerTimesPage.tsx": "Prayer times page that uses location selection to fetch and display daily prayer times for five obligatory prayers, with loading and error states.",
  "frontend/src/pages/QuranPage.tsx": "Quran reading page with a two-column layout: surah list sidebar for navigation and main content area displaying selected surah text with loading/error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (including Islamic-themed colors like gold, emerald, teal), typography, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project metadata tracking the Islamic Companion app's features (Quran text, festival calendar, prayer times), architectural state, and design requirements including Islamic-themed visual aesthetics."
}